lucasantoro/Sunrise/communications/openvlc/firmware-v2/firmware/platform/stm32h7/openvlc_stm32_tx_hal.c
#include "openvlc_stm32_tx_hal.h"

#include "openvlc_app.h" /* openvlc_platform_log */

#include <string.h>

#if defined(__GNUC__)
#define OPENVLC_WEAK __attribute__((weak))
#define OPENVLC_STATIC_ASSERT(condition, message) _Static_assert(condition, message)
#else
#define OPENVLC_WEAK
#define OPENVLC_STATIC_ASSERT(condition, message) \
	typedef char openvlc_static_assertion[(condition) ? 1 : -1]
#endif

#if defined(__has_include)
#if __has_include("openvlc_board.h")
#include "openvlc_board.h"
#endif
#endif

#ifndef OPENVLC_STM32_TX_INTERFRAME_GUARD_US
#define OPENVLC_STM32_TX_INTERFRAME_GUARD_US 0u
#endif
#ifndef OPENVLC_STM32_TX_TARGET_PERIOD_US
#define OPENVLC_STM32_TX_TARGET_PERIOD_US 0u
#endif

#if defined(STM32H743xx) || defined(STM32H723xx)
#include "stm32h7xx_hal.h"
#include "main.h"
extern TIM_HandleTypeDef htim1;
extern void Error_Handler(void);
#endif

#ifndef OPENVLC_TX_GPIO_PORT
#ifdef OPENVLC_TX_GPIO_Port
#define OPENVLC_TX_GPIO_PORT OPENVLC_TX_GPIO_Port
#else
#define OPENVLC_TX_GPIO_PORT GPIOA
#endif
#endif

#ifndef OPENVLC_TX_GPIO_PIN
#ifdef OPENVLC_TX_Pin
#define OPENVLC_TX_GPIO_PIN OPENVLC_TX_Pin
#else
#define OPENVLC_TX_GPIO_PIN GPIO_PIN_6
#endif
#endif

/*
 * RAM_D2 jitter experiment. OPENVLC_TX_DMA_IN_D2 places the DMA cell buffers in
 * RAM_D2 instead of RAM_D1. This was an early placement experiment; production
 * uses DMA2 for TX and keeps the full-size buffers in cacheable RAM_D1 with
 * explicit clean-before-DMA coherency.
 * Two MAX-size slots do not fit in 32 KB RAM_D2, so this also shrinks the
 * buffer: use it ONLY with the small fixed-payload test (OPENVLC_TX_HOST_MODE=0,
 * ~128-byte payload). Revert it for full-size / host traffic.
 */
#if defined(OPENVLC_TX_DMA_IN_D2) && OPENVLC_TX_DMA_IN_D2
#ifndef OPENVLC_STM32_TX_DMA_WORDS
#define OPENVLC_STM32_TX_DMA_WORDS 3072u   /* 4 OC slots x 6 KB = 24 KB < 32 KB */
#endif
#define OPENVLC_TX_BUFFER_SECTION ".dma_buffer"
#elif defined(OPENVLC_TX_DMA_NONCACHEABLE) && OPENVLC_TX_DMA_NONCACHEABLE
#ifndef OPENVLC_STM32_TX_DMA_WORDS
#define OPENVLC_STM32_TX_DMA_WORDS \
	(OPENVLC_MAX_SYMBOLS + OPENVLC_STM32_TX_WARMUP_CELLS + \
	 OPENVLC_STM32_TX_GAP_CELLS + 8u)
#endif
#define OPENVLC_TX_BUFFER_SECTION ".tx_dma_buffer"
#else
#ifndef OPENVLC_STM32_TX_DMA_WORDS
#define OPENVLC_STM32_TX_DMA_WORDS \
	(OPENVLC_MAX_SYMBOLS + OPENVLC_STM32_TX_WARMUP_CELLS + \
	 OPENVLC_STM32_TX_GAP_CELLS + 8u)
#endif
#define OPENVLC_TX_BUFFER_SECTION ".rx_buffer"
#endif

#if defined(OPENVLC_TX_USE_TIMER_OC) && OPENVLC_TX_USE_TIMER_OC
typedef uint16_t openvlc_tx_dma_word_t;
#ifndef OPENVLC_STM32_TX_SLOT_COUNT
#define OPENVLC_STM32_TX_SLOT_COUNT 4u
#endif
#else
typedef uint32_t openvlc_tx_dma_word_t;
#ifndef OPENVLC_STM32_TX_SLOT_COUNT
#define OPENVLC_STM32_TX_SLOT_COUNT 2u
#endif
#endif
#define OPENVLC_STM32_TX_DMA_WORDS_ALIGNED \
	((OPENVLC_STM32_TX_DMA_WORDS + 7u) & ~7u)

#if defined(OPENVLC_TX_USE_TIMER_OC) && OPENVLC_TX_USE_TIMER_OC
#define OPENVLC_TX_TIM_DMA_ID TIM_DMA_ID_CC4
#define OPENVLC_TX_TIM_DMA_SOURCE TIM_DMA_CC4
OPENVLC_STATIC_ASSERT(OPENVLC_STM32_TX_GAP_CELLS >= 3u,
		      "timer OC completion requires at least three low gap cells");
#else
#define OPENVLC_TX_TIM_DMA_ID TIM_DMA_ID_UPDATE
#define OPENVLC_TX_TIM_DMA_SOURCE TIM_DMA_UPDATE
#endif

#if defined(__GNUC__) && (defined(STM32H743xx) || defined(STM32H723xx))
#define OPENVLC_TX_BUFFER \
	__attribute__((section(OPENVLC_TX_BUFFER_SECTION), aligned(32)))
#else
#define OPENVLC_TX_BUFFER
#endif

typedef enum {
	TX_SLOT_FREE = 0,
	TX_SLOT_PREPARING,
	TX_SLOT_READY,
	TX_SLOT_ACTIVE,
} tx_slot_state_t;

typedef struct {
	volatile uint8_t state;
	uint32_t word_len;
	uint32_t cell_ticks;
	uint32_t generation;
	uint32_t enqueue_order;
	uint32_t high_words;
	uint32_t low_words;
	uint32_t word_checksum;
} tx_slot_t;

#if defined(OPENVLC_TX_DMA_NONCACHEABLE) && OPENVLC_TX_DMA_NONCACHEABLE
/*
 * The FLASH linker and MPU reserve exactly 96 KB at 0x24028000 for all TX
 * cell streams. Fail at compile time when payload, warm-up or slot changes
 * exceed that contract instead of reporting a later section overlap.
 */
OPENVLC_STATIC_ASSERT(
	OPENVLC_STM32_TX_SLOT_COUNT *
	OPENVLC_STM32_TX_DMA_WORDS_ALIGNED *
	sizeof(openvlc_tx_dma_word_t) <= 96u * 1024u,
	"TX DMA slots exceed the 96 KB non-cacheable MPU window");
#endif

static openvlc_tx_dma_word_t
	tx_dma_words[OPENVLC_STM32_TX_SLOT_COUNT]
		    [OPENVLC_STM32_TX_DMA_WORDS_ALIGNED] OPENVLC_TX_BUFFER;
static tx_slot_t tx_slots[OPENVLC_STM32_TX_SLOT_COUNT];
static volatile int tx_busy;
static volatile int8_t tx_active_slot = -1;
static openvlc_stm32_tx_stats_t tx_stats;
static int8_t tx_last_slot = -1;
static uint32_t tx_last_generation;
static uint32_t tx_generation;
static uint32_t tx_enqueue_order;
static uint32_t tx_last_started_order;
static volatile uint32_t tx_active_start_cycles;
static uint32_t tx_completion_baseline_cycles;
/* Line-cell period used to shape the inter-frame idle square wave. */
static uint32_t tx_idle_cell_ticks = OPENVLC_STM32_TX_CELL_TICKS;
/* Set while the inter-frame idle waveform is driving the TX pin. */
static volatile uint8_t tx_idle_active;
/*
 * Set by the DMA-completion ISR when a stream frame ends; consumed by
 * openvlc_stm32_tx_idle_poll() once OPENVLC_TX_IDLE_GAP_US of darkness has
 * elapsed. Deferring the keep-alive start is what gives the receiver an idle
 * interval to segment the burst on - see OPENVLC_TX_IDLE_GAP_US.
 */
static volatile uint8_t tx_idle_pending;
static volatile uint32_t tx_last_complete_cycles;
static volatile uint8_t tx_guard_pending;
static volatile uint8_t tx_guard_counted;
static volatile uint8_t tx_guard_timer_armed;
#if OPENVLC_TX_HW_DIAG
static openvlc_stm32_tx_hw_diag_t tx_hw_diag;
static openvlc_stm32_tx_hw_diag_t tx_hw_first_fault;
static uint32_t tx_diag_last_generation;
static uint32_t tx_diag_last_ndtr;
static uint32_t tx_diag_last_progress_cycles;
static uint32_t tx_diag_last_sample_cycles;

#define OPENVLC_TX_DMA_STREAM0_ERROR_FLAGS \
	(DMA_LISR_FEIF0 | DMA_LISR_DMEIF0 | DMA_LISR_TEIF0)
#define OPENVLC_TX_DIAG_SAMPLE_CYCLES \
	(SystemCoreClock / 10000u) /* 100 us, low enough overhead for full duplex. */
#define OPENVLC_TX_DIAG_STALL_CYCLES \
	(SystemCoreClock / 2000u) /* 500 us: 1000 complete line cells at 2 MHz. */
#endif

