lucasantoro/Sunrise/communications/openvlc/firmware-v2/firmware/platform/stm32h7/openvlc_stm32_tx_hal.c
#if defined(STM32H743xx) || defined(STM32H723xx)
static uint32_t tx_irq_lock(void)
{
	uint32_t primask = __get_PRIMASK();

	__disable_irq();
	return primask;
}

static void tx_irq_unlock(uint32_t primask)
{
	if (primask == 0u)
		__enable_irq();
}

static uint32_t tx_cycle_count(void)
{
	return DWT->CYCCNT;
}
#else
static uint32_t tx_irq_lock(void)
{
	return 0u;
}

static void tx_irq_unlock(uint32_t primask)
{
	(void)primask;
}

static uint32_t tx_cycle_count(void)
{
	return 0u;
}
#endif

#if defined(STM32H743xx) || defined(STM32H723xx)
static void tx_guard_timer_stop(void)
{
	TIM6->DIER = 0u;
	TIM6->CR1 = 0u;
	TIM6->SR = 0u;
	tx_guard_timer_armed = 0u;
}

static void tx_guard_timer_arm(uint32_t remaining_cycles)
{
	uint32_t cycles_per_us = SystemCoreClock / 1000000u;
	uint32_t remaining_us;

	if (!remaining_cycles || !cycles_per_us)
		return;
	remaining_us =
		(remaining_cycles + cycles_per_us - 1u) / cycles_per_us;
	if (!remaining_us)
		remaining_us = 1u;
	if (remaining_us > 0xffffu)
		remaining_us = 0xffffu;

	/*
	 * TIM6 is otherwise unused. Its APB1 timer clock is the same 192 MHz
	 * kernel used by the OpenVLC timer profile. Run it at 1 MHz in one-pulse
	 * mode so the guard deadline can wake TX even while thread mode is inside
	 * the synchronous RX decoder.
	 */
	TIM6->CR1 = 0u;
	TIM6->DIER = 0u;
	TIM6->PSC = (OPENVLC_STM32_TX_TIMER_HZ / 1000000u) - 1u;
	TIM6->ARR = remaining_us - 1u;
	TIM6->CNT = 0u;
	TIM6->EGR = TIM_EGR_UG;
	TIM6->SR = 0u;
	TIM6->DIER = TIM_DIER_UIE;
	tx_guard_timer_armed = 1u;
	TIM6->CR1 = TIM_CR1_OPM | TIM_CR1_CEN;
}
#endif

#if (defined(STM32H743xx) || defined(STM32H723xx)) && OPENVLC_TX_HW_DIAG
static void tx_read_hw_snapshot(openvlc_stm32_tx_hw_diag_t *out)
{
	DMA_HandleTypeDef *hdma = htim1.hdma[OPENVLC_TX_TIM_DMA_ID];
	DMA_Stream_TypeDef *stream =
		(hdma && hdma->Instance) ?
		(DMA_Stream_TypeDef *)hdma->Instance : NULL;
	int slot = tx_active_slot;

	memset(out, 0, sizeof(*out));
	out->busy = tx_busy ? 1u : 0u;
	out->active_slot = slot;
	if (slot >= 0 && slot < (int)OPENVLC_STM32_TX_SLOT_COUNT) {
		out->active_generation = tx_slots[slot].generation;
		out->active_words = tx_slots[slot].word_len;
	}
	out->tim_cr1 = TIM1->CR1;
	out->tim_dier = TIM1->DIER;
	out->tim_sr = TIM1->SR;
	out->tim_cnt = TIM1->CNT;
	out->tim_arr = TIM1->ARR;
	out->tim_ccr1 = TIM1->CCR1;
	out->tim_ccr4 = TIM1->CCR4;
	out->tim_ccer = TIM1->CCER;
	out->tim_bdtr = TIM1->BDTR;
	if (stream) {
		out->dma_cr = stream->CR;
		out->dma_ndtr = stream->NDTR;
		out->dma_par = stream->PAR;
		out->dma_m0ar = stream->M0AR;
		out->dma_fcr = stream->FCR;
	}
	out->dma_lisr = DMA2->LISR;
	if (hdma && hdma->DMAmuxChannel)
		out->dmamux_ccr = hdma->DMAmuxChannel->CCR;
	if (hdma && hdma->DMAmuxChannelStatus)
		out->dmamux_csr = hdma->DMAmuxChannelStatus->CSR;
	out->gpio_moder = OPENVLC_TX_GPIO_PORT->MODER;
	out->gpio_ospeedr = OPENVLC_TX_GPIO_PORT->OSPEEDR;
	out->gpio_pupdr = OPENVLC_TX_GPIO_PORT->PUPDR;
	out->gpio_idr = OPENVLC_TX_GPIO_PORT->IDR;
	out->gpio_odr = OPENVLC_TX_GPIO_PORT->ODR;
	out->gpio_afrh = OPENVLC_TX_GPIO_PORT->AFR[1];
}

static uint32_t tx_hw_fault_flags(const openvlc_stm32_tx_hw_diag_t *s)
{
	DMA_HandleTypeDef *hdma = htim1.hdma[OPENVLC_TX_TIM_DMA_ID];
	uint32_t faults = 0u;
	uint32_t pin_shift = POSITION_VAL(OPENVLC_TX_GPIO_PIN) * 2u;
	uint32_t af_shift = (POSITION_VAL(OPENVLC_TX_GPIO_PIN) - 8u) * 4u;
	uint32_t expected_m0ar = 0u;
	uint32_t completion_pending =
		s->busy && s->dma_ndtr == 0u &&
		((s->dma_lisr & DMA_LISR_TCIF0) != 0u);

	if (s->busy) {
		if (s->active_slot < 0 ||
		    s->active_slot >= (int32_t)OPENVLC_STM32_TX_SLOT_COUNT)
			faults |= OPENVLC_TX_HW_FAULT_SLOT;
		else
			expected_m0ar = (uint32_t)(uintptr_t)
				&tx_dma_words[s->active_slot][1];
		if ((s->tim_cr1 & TIM_CR1_CEN) == 0u)
			faults |= OPENVLC_TX_HW_FAULT_TIMER_STOPPED;
		/* In normal mode the stream clears EN at NDTR=0 before its completion
		 * IRQ runs. Do not report that short, legitimate hand-off as a fault;
		 * the independent progress monitor still flags it if it lasts 500 us. */
		if (!completion_pending && (s->dma_cr & DMA_SxCR_EN) == 0u)
			faults |= OPENVLC_TX_HW_FAULT_DMA_STOPPED;
		if ((s->tim_dier & OPENVLC_TX_TIM_DMA_SOURCE) == 0u)
			faults |= OPENVLC_TX_HW_FAULT_DMA_REQUEST;
#if !defined(OPENVLC_TX_SILENT_OUTPUT) || !OPENVLC_TX_SILENT_OUTPUT
		if ((s->tim_ccer & TIM_CCER_CC1E) == 0u)
			faults |= OPENVLC_TX_HW_FAULT_OUTPUT_GATE;
#endif
		if ((s->tim_bdtr & TIM_BDTR_MOE) == 0u)
			faults |= OPENVLC_TX_HW_FAULT_MOE;
		if (s->tim_arr != OPENVLC_STM32_TX_CELL_TICKS - 1u ||
		    s->tim_ccr4 != OPENVLC_STM32_TX_CELL_TICKS /
				       OPENVLC_TX_OC_DMA_PHASE_DIV)
			faults |= OPENVLC_TX_HW_FAULT_TIMING;
		if (s->tim_ccr1 != 0u &&
		    s->tim_ccr1 != OPENVLC_STM32_TX_CELL_TICKS)
			faults |= OPENVLC_TX_HW_FAULT_CCR1;
		if ((!completion_pending && s->dma_ndtr == 0u) ||
		    s->dma_ndtr >= s->active_words)
			faults |= OPENVLC_TX_HW_FAULT_NDTR;
		if (s->dma_par != (uint32_t)(uintptr_t)&TIM1->CCR1 ||
		    (expected_m0ar && s->dma_m0ar != expected_m0ar))
			faults |= OPENVLC_TX_HW_FAULT_ADDRESS;
	} else {
#if defined(OPENVLC_TX_IDLE_KEEPALIVE) && OPENVLC_TX_IDLE_KEEPALIVE
		/*
		 * Idle keep-alive deliberately leaves TIM1 and CH1 running between
		 * frames, so CEN/CC1E/MOE are expected to be set here. Only a DMA
		 * stream still enabled without an active slot is a real fault.
		 */
		if ((s->dma_cr & DMA_SxCR_EN) != 0u)
			faults |= OPENVLC_TX_HW_FAULT_OUTPUT_GATE;
#else
		if ((s->tim_cr1 & TIM_CR1_CEN) != 0u ||
		    (s->dma_cr & DMA_SxCR_EN) != 0u ||
		    (s->tim_ccer & TIM_CCER_CC1E) != 0u ||
		    (s->tim_bdtr & TIM_BDTR_MOE) != 0u)
			faults |= OPENVLC_TX_HW_FAULT_OUTPUT_GATE;
#endif
	}
	if (((s->gpio_moder >> pin_shift) & 3u) != 2u ||
	    ((s->gpio_afrh >> af_shift) & 15u) != GPIO_AF1_TIM1)
		faults |= OPENVLC_TX_HW_FAULT_GPIO;
	if ((s->dma_lisr & OPENVLC_TX_DMA_STREAM0_ERROR_FLAGS) != 0u)
		faults |= OPENVLC_TX_HW_FAULT_DMA_ERROR;
	if (hdma && hdma->DMAmuxChannelStatus &&
	    (s->dmamux_csr &
	     hdma->DMAmuxChannelStatusMask) != 0u)
		faults |= OPENVLC_TX_HW_FAULT_DMAMUX;
	return faults;
}
#endif

static int tx_find_slot(uint8_t state)
{
	for (uint32_t i = 0; i < OPENVLC_STM32_TX_SLOT_COUNT; i++) {
		if (tx_slots[i].state == state)
			return (int)i;
	}
	return -1;
}

