lucasantoro/Sunrise/communications/openvlc/firmware-v2/firmware/platform/stm32h7/openvlc_stm32_tx_hal.c
/*
 * READY slots form a logical FIFO even though their storage is a reusable
 * array.  Index order is not age order: a newly reused low slot must never
 * overtake an older high slot.  Unsigned age also remains correct across the
 * uint32_t wrap because at most four orders are outstanding.
 */
static int tx_find_oldest_ready(void)
{
	int oldest = -1;
	uint32_t oldest_age = 0u;

	for (uint32_t i = 0; i < OPENVLC_STM32_TX_SLOT_COUNT; i++) {
		uint32_t age;

		if (tx_slots[i].state != TX_SLOT_READY)
			continue;
		age = tx_enqueue_order - tx_slots[i].enqueue_order;
		if (oldest < 0 || age > oldest_age) {
			oldest = (int)i;
			oldest_age = age;
		}
	}
	return oldest;
}

static uint32_t tx_pipeline_depth_locked(void)
{
	uint32_t depth = 0;

	for (uint32_t i = 0; i < OPENVLC_STM32_TX_SLOT_COUNT; i++) {
		if (tx_slots[i].state != TX_SLOT_FREE)
			depth++;
	}
	return depth;
}

static void tx_complete_common(int dma_error)
{
	int slot = tx_active_slot;
	int ready;

#if defined(STM32H743xx) || defined(STM32H723xx)
	uint32_t complete_cycles = tx_cycle_count();
	DMA_HandleTypeDef *hdma = htim1.hdma[OPENVLC_TX_TIM_DMA_ID];

	if (slot >= 0 && slot < (int)OPENVLC_STM32_TX_SLOT_COUNT &&
	    tx_slots[slot].word_len >= 2u) {
		uint32_t timer_ratio =
			SystemCoreClock / OPENVLC_STM32_TX_TIMER_HZ;
		uint32_t expected_cycles =
			((tx_slots[slot].word_len - 2u) *
			 tx_slots[slot].cell_ticks + htim1.Instance->CCR4) *
			timer_ratio;
		uint32_t duration_cycles =
			complete_cycles - tx_active_start_cycles;
		uint32_t late_cycles = duration_cycles > expected_cycles ?
			duration_cycles - expected_cycles : 0u;
		uint32_t excess_cycles;

		tx_stats.last_duration_cycles = duration_cycles;
		/*
		 * HAL_DMA_IRQHandler and exception entry add a fixed delay between
		 * the final peripheral write and this callback. Learn that baseline
		 * and report only additional scheduling jitter. An absolute
		 * comparison marks every healthy frame as late.
		 */
		if (late_cycles < tx_completion_baseline_cycles)
			tx_completion_baseline_cycles = late_cycles;
		excess_cycles =
			late_cycles - tx_completion_baseline_cycles;
		if (excess_cycles > tx_stats.max_completion_late_cycles)
			tx_stats.max_completion_late_cycles = excess_cycles;
		if (excess_cycles >
		    tx_slots[slot].cell_ticks * timer_ratio)
			tx_stats.late_completions++;
	}
	if (hdma && hdma->Instance) {
		tx_stats.last_dma_fcr =
			((DMA_Stream_TypeDef *)hdma->Instance)->FCR;
		tx_stats.last_dma_error = hdma->ErrorCode;
	}
	__HAL_TIM_DISABLE_DMA(&htim1, OPENVLC_TX_TIM_DMA_SOURCE);
#if defined(OPENVLC_TX_USE_TIMER_OC) && OPENVLC_TX_USE_TIMER_OC
	CLEAR_BIT(htim1.Instance->CR1, TIM_CR1_CEN);
#else
	(void)HAL_TIM_Base_Stop(&htim1);
#endif
#if defined(OPENVLC_TX_USE_TIMER_OC) && OPENVLC_TX_USE_TIMER_OC
#if defined(OPENVLC_TX_IDLE_KEEPALIVE) && OPENVLC_TX_IDLE_KEEPALIVE
	/*
	 * Idle keep-alive. Going dark here is what lets the receiver AGC ramp to
	 * full gain and chatter on its own noise floor, which buries the next
	 * frame's preamble/SFD. Instead leave TIM1 free-running as a plain 50%
	 * square wave at the line-cell rate: DMA is already stopped above, so no
	 * cell data is consumed and the output is a constant alternating pattern
	 * identical to the warm-up. It carries no framing and cannot be mistaken
	 * for a packet, but it holds the AGC at its operating point.
	 * tx_arm_and_start() rewrites ARR/CCR1 and restarts the counter for the
	 * next frame, so no extra teardown is needed here.
	 *
	 * Only hold the light on for an actual STREAM. tx_last_complete_cycles is
	 * still the PREVIOUS completion at this point, so the gap below is the
	 * real inter-frame interval. Isolated packets - the bridge emits about one
	 * control frame per second even when the user is not transmitting - must
	 * leave the LED dark, otherwise it visibly blinks once per second and
	 * illuminates the local photodiode for no benefit: a lone frame has no
	 * successor whose AGC settling we could protect.
	 */
	{
		uint32_t cycles_per_ms = SystemCoreClock / 1000u;
		uint32_t gap = tx_cycle_count() - tx_last_complete_cycles;
		bool streaming =
			tx_last_complete_cycles != 0u && cycles_per_ms != 0u &&
			gap <= (OPENVLC_TX_IDLE_STREAM_GAP_MS * cycles_per_ms);

		/*
		 * Go dark either way. When streaming, only ARM the keep-alive:
		 * openvlc_stm32_tx_idle_poll() turns the light back on after
		 * OPENVLC_TX_IDLE_GAP_US, and that short darkness is the idle
		 * interval the receiver segments the burst on. Starting it here
		 * instead would leave the line modulating without a break, so the
		 * keep-alive would land inside the frame's own burst.
		 */
		CLEAR_BIT(htim1.Instance->CCER, TIM_CCER_CC1E);
		CLEAR_BIT(htim1.Instance->BDTR, TIM_BDTR_MOE);
		CLEAR_BIT(htim1.Instance->CCMR1, TIM_CCMR1_OC1PE);
		htim1.Instance->CCR1 = 0u;
		SET_BIT(htim1.Instance->CCMR1, TIM_CCMR1_OC1PE);
		tx_idle_active = 0u;
		tx_idle_pending = streaming ? 1u : 0u;
	}
#else
	/*
	 * DMA completes while CH1 is already inside the low inter-frame tail.
	 * Disconnect the timer output; the TX-pin pulldown preserves the low level.
	 */
	CLEAR_BIT(htim1.Instance->CCER, TIM_CCER_CC1E);
	CLEAR_BIT(htim1.Instance->BDTR, TIM_BDTR_MOE);
	CLEAR_BIT(htim1.Instance->CCMR1, TIM_CCMR1_OC1PE);
	htim1.Instance->CCR1 = 0u;
	SET_BIT(htim1.Instance->CCMR1, TIM_CCMR1_OC1PE);
#endif
#else
	HAL_GPIO_WritePin(OPENVLC_TX_GPIO_PORT, OPENVLC_TX_GPIO_PIN,
			  GPIO_PIN_RESET);
#endif
#endif
	if (dma_error)
		tx_stats.dma_errors++;
	else
		tx_stats.completed++;
	if (slot >= 0 && slot < (int)OPENVLC_STM32_TX_SLOT_COUNT)
		tx_slots[slot].state = TX_SLOT_FREE;
	tx_active_slot = -1;
	tx_busy = 0;
	tx_last_complete_cycles = tx_cycle_count();
	tx_guard_pending =
		OPENVLC_STM32_TX_INTERFRAME_GUARD_US != 0u ||
		OPENVLC_STM32_TX_TARGET_PERIOD_US != 0u;
	tx_guard_counted = 0u;
	tx_guard_timer_armed = 0u;
	ready = tx_find_oldest_ready();
	if (!dma_error && ready < 0)
		tx_stats.pipeline_empty++;
	/* Notify the host layer without doing encoder work in IRQ context. */
	openvlc_stm32_tx_slot_freed();
}

OPENVLC_WEAK void openvlc_stm32_tx_slot_freed(void)
{
}

