lucasantoro/Sunrise/communications/openvlc/firmware-v2/firmware/platform/stm32h7/openvlc_stm32_tx_hal.c
#if defined(STM32H743xx) || defined(STM32H723xx)
static void tx_dma_complete(DMA_HandleTypeDef *hdma)
{
	uint32_t started_before;

	(void)hdma;
	started_before = tx_stats.started;
	tx_complete_common(0);
	/*
	 * RX burst decoding can keep the main loop busy longer than an optical
	 * frame. Chain an already encoded slot here so TIM1 does not sit idle
	 * waiting for the next foreground service call. A configured real-time
	 * guard deliberately forbids IRQ chaining; the foreground poll starts the
	 * next slot after the guard deadline instead.
	 */
	openvlc_stm32_tx_service();
	if (tx_stats.started != started_before)
		tx_stats.isr_chained++;
}

static void tx_dma_error(DMA_HandleTypeDef *hdma)
{
	(void)hdma;
	tx_complete_common(1);
}

#if !defined(OPENVLC_TX_DMA_NONCACHEABLE) || !OPENVLC_TX_DMA_NONCACHEABLE
static void tx_clean_dcache(const openvlc_tx_dma_word_t *words,
			    size_t word_len)
{
#if defined(__DCACHE_PRESENT) && (__DCACHE_PRESENT == 1U)
	uintptr_t start;
	uintptr_t end;

	/*
	 * Only run cache maintenance when the D-cache is actually enabled. With
	 * it disabled the DMA buffer is already coherent. Production enables
	 * D-cache, so clean the completed TX slot before DMA2 reads it.
	 */
	if ((SCB->CCR & SCB_CCR_DC_Msk) == 0u)
		return;

	start = (uintptr_t)words;
	end = start + word_len * sizeof(words[0]);
	start &= ~(uintptr_t)31u;
	end = (end + 31u) & ~(uintptr_t)31u;
	SCB_CleanDCache_by_Addr((uint32_t *)start, (int32_t)(end - start));
#else
	(void)words;
	(void)word_len;
#endif
}
#endif

/*
 * Arm TIM1 CH4 DMA to clock out one prepared TX slot.
 */
static int tx_arm_and_start(int slot)
{
	DMA_HandleTypeDef *hdma = htim1.hdma[OPENVLC_TX_TIM_DMA_ID];
	openvlc_tx_dma_word_t *words = tx_dma_words[slot];
	uint32_t word_len = tx_slots[slot].word_len;
	uint32_t cell_ticks = tx_slots[slot].cell_ticks;
	openvlc_tx_dma_word_t *dma_words = words;
	uint32_t dma_word_len = word_len;

	if (!hdma || !hdma->Instance || word_len == 0u)
		return -3;
	/* Keep the inter-frame idle waveform at this frame's line-cell rate. */
	if (cell_ticks)
		tx_idle_cell_ticks = cell_ticks;
	/* A real frame takes the timer over from any idle waveform. */
	tx_idle_active = 0u;
	tx_stats.last_dma_words = word_len;
	tx_stats.last_high_words = tx_slots[slot].high_words;
	tx_stats.last_low_words = tx_slots[slot].low_words;
	tx_stats.last_word_checksum = tx_slots[slot].word_checksum;
	hdma->XferCpltCallback = tx_dma_complete;
	hdma->XferErrorCallback = tx_dma_error;
	/*
	 * The slot was cleaned before it changed from PREPARING to READY.
	 * Nothing may modify it while READY/ACTIVE, so starting a chained slot
	 * from the DMA-complete IRQ needs no cache maintenance here. Cleaning here
	 * would push a ~24 kB frame through a priority-1 interrupt and stall
	 * comparator-ring draining long enough to lose RX frames.
	 */

	__HAL_TIM_DISABLE_DMA(&htim1, OPENVLC_TX_TIM_DMA_SOURCE);
#if defined(OPENVLC_TX_USE_TIMER_OC) && OPENVLC_TX_USE_TIMER_OC
	CLEAR_BIT(htim1.Instance->CR1, TIM_CR1_CEN);
#else
	(void)HAL_TIM_Base_Stop(&htim1);
#endif
	__HAL_TIM_SET_AUTORELOAD(&htim1, cell_ticks - 1u);
	__HAL_TIM_SET_COUNTER(&htim1, 0u);
#if defined(OPENVLC_TX_USE_TIMER_OC) && OPENVLC_TX_USE_TIMER_OC
	/*
	 * Seed the active CCR with cell 0. CH4 DMA writes cell N+1 into the CCR1
	 * preload during cell N, so the next update changes the TX pin exactly on
	 * the timer boundary. DMA completion lands in the low tail because the
	 * frame builder appends 32+ low cells, so stopping there cannot clip data.
	 *
	 * CC1E is dropped while CCR1 is seeded and the DMA is rebuilt, parking the
	 * pin on its pulldown. Leaving the channel connected instead would avoid a
	 * sub-microsecond electrical runt, but it makes the pin HOLD the seed level
	 * for the whole rebuild - so whenever cell 0 is high the LED stays lit for
	 * microseconds at every frame start. That is a DC step into the receiver
	 * AGC 125 times a second, and it costs far more than the runt it removes.
	 *
	 * OPENVLC_TX_KEEP_OUTPUT_ENABLED=1 selects the alternative.
	 */
#if !defined(OPENVLC_TX_KEEP_OUTPUT_ENABLED) || !OPENVLC_TX_KEEP_OUTPUT_ENABLED
	CLEAR_BIT(htim1.Instance->CCER, TIM_CCER_CC1E);
#endif
	CLEAR_BIT(htim1.Instance->CCMR1, TIM_CCMR1_OC1PE);
	htim1.Instance->CCR1 = words[0];
	SET_BIT(htim1.Instance->CCMR1, TIM_CCMR1_OC1PE);
	htim1.Instance->CCR4 =
		cell_ticks / OPENVLC_TX_OC_DMA_PHASE_DIV;
	if (htim1.Instance->CCR4 == 0u)
		htim1.Instance->CCR4 = 1u;
	dma_words = words + 1u;
	dma_word_len = word_len - 1u;
	if (dma_word_len == 0u)
		return -3;
#endif
	htim1.Instance->SR = 0u;
	if (HAL_DMA_Start_IT(hdma, (uint32_t)dma_words,
#if defined(OPENVLC_TX_USE_TIMER_OC) && OPENVLC_TX_USE_TIMER_OC
			     (uint32_t)&htim1.Instance->CCR1,
#else
			     (uint32_t)&OPENVLC_TX_GPIO_PORT->BSRR,
#endif
			     dma_word_len) != HAL_OK) {
		tx_stats.dma_errors++;
		return -4;
	}
	if ((htim1.Instance->ARR != cell_ticks - 1u) ||
	    ((((DMA_Stream_TypeDef *)hdma->Instance)->FCR &
	      DMA_SxFCR_DMDIS) == 0u) ||
	    ((((DMA_Stream_TypeDef *)hdma->Instance)->CR &
	      DMA_SxCR_PL) != DMA_PRIORITY_VERY_HIGH))
		tx_stats.config_errors++;
	__HAL_TIM_ENABLE_DMA(&htim1, OPENVLC_TX_TIM_DMA_SOURCE);
#if defined(OPENVLC_TX_USE_TIMER_OC) && OPENVLC_TX_USE_TIMER_OC
	/*
	 * Keep these writes adjacent. Calling HAL_TIM_Base_Start after enabling
	 * CH1 would extend the first high preamble cell by the HAL call latency.
	 */
#if defined(OPENVLC_TX_SILENT_OUTPUT) && OPENVLC_TX_SILENT_OUTPUT
	/* DIAGNOSTIC build: run the complete TX chain (encode, TIM1, DMA, IRQs,
	 * UART) with CH1 never connected to the pin, so the TX output stays low. */
#else
	SET_BIT(htim1.Instance->CCER, TIM_CCER_CC1E);
#endif
	/* TIM1 is an advanced-control timer: MOE gates CH1 independently of CC1E. */
	SET_BIT(htim1.Instance->BDTR, TIM_BDTR_MOE);
	tx_active_start_cycles = tx_cycle_count();
	SET_BIT(htim1.Instance->CR1, TIM_CR1_CEN);
#else
	if (HAL_TIM_Base_Start(&htim1) != HAL_OK) {
		__HAL_TIM_DISABLE_DMA(&htim1, OPENVLC_TX_TIM_DMA_SOURCE);
		(void)HAL_DMA_Abort(hdma);
		tx_stats.dma_errors++;
		return -5;
	}
#endif
	tx_stats.started++;
	return 0;
}
#endif

void openvlc_stm32_tx_pin_probe(openvlc_stm32_tx_pin_probe_t *out)
{
	if (!out)
		return;
	memset(out, 0, sizeof(*out));
#if defined(STM32H743xx) || defined(STM32H723xx)
	{
		/*
		 * Sample the TX pad directly. 4096 back-to-back IDR reads span
		 * roughly 30-60 us (~60-120 line cells at 2 Mcell/s), enough to
		 * measure toggling and duty. Interrupts stay enabled: a rare
		 * preemption only merges two runs, which barely perturbs the
		 * aggregate edge/high counts. Read-only - never gates the timer.
		 */
		const uint32_t samples = 4096u;
		volatile uint32_t *idr = &OPENVLC_TX_GPIO_PORT->IDR;
		uint32_t pin = (uint32_t)OPENVLC_TX_GPIO_PIN;
		uint32_t prev = (*idr & pin) ? 1u : 0u;
		uint32_t high = prev;
		uint32_t edges = 0u;
		uint32_t start;
		uint32_t i;

