lucasantoro/Sunrise/communications/openvlc/firmware-v2/firmware/platform/stm32h7/openvlc_stm32_tx_hal.c
		out->busy_start = tx_busy ? 1u : 0u;
		out->active_slot = tx_active_slot;
		start = tx_cycle_count();
		for (i = 1u; i < samples; i++) {
			uint32_t s = (*idr & pin) ? 1u : 0u;

			high += s;
			edges += (s ^ prev);
			prev = s;
		}
		out->cycles = tx_cycle_count() - start;
		out->busy_end = tx_busy ? 1u : 0u;
		out->samples = samples;
		out->high_samples = high;
		out->edges = edges;
	}
#endif
}

void openvlc_stm32_tx_banner(void)
{
#if defined(STM32H743xx) || defined(STM32H723xx)
	const openvlc_tx_profile_t *profile = openvlc_tx_default_profile();
	uint32_t cell_ticks = profile ? profile->cell_ticks : 0u;
	uint32_t cell_hz = cell_ticks ?
		OPENVLC_STM32_TX_TIMER_HZ / cell_ticks : 0u;

	openvlc_platform_log(
		"TXCFG build=%s-%s node=%u phy=%uk budget=%u silent=%u "
		"timhz=%lu cellticks=%lu cellrate_khz=%lu period_us=%u guard_us=%u "
		"slots=%u wordbytes=%u bufbase=%08lx bufbytes=%lu noncache=%u\r\n",
		__DATE__, __TIME__,
		(unsigned int)OPENVLC_TRANSCEIVER_NODE,
		(unsigned int)OPENVLC_PHY_RATE_KBPS,
		(unsigned int)OPENVLC_STM32_TX_PROFILE_BUDGET,
		(unsigned int)(OPENVLC_TX_SILENT_OUTPUT ? 1u : 0u),
		(unsigned long)OPENVLC_STM32_TX_TIMER_HZ,
		(unsigned long)cell_ticks,
		(unsigned long)(cell_hz / 1000u),
		(unsigned int)OPENVLC_STM32_TX_TARGET_PERIOD_US,
		(unsigned int)OPENVLC_STM32_TX_INTERFRAME_GUARD_US,
		(unsigned int)OPENVLC_STM32_TX_SLOT_COUNT,
		(unsigned int)sizeof(openvlc_tx_dma_word_t),
		(unsigned long)(uintptr_t)&tx_dma_words[0][0],
		(unsigned long)sizeof(tx_dma_words),
		(unsigned int)(
#if defined(OPENVLC_TX_DMA_NONCACHEABLE) && OPENVLC_TX_DMA_NONCACHEABLE
			1u
#else
			0u
#endif
			));
#endif
}

int openvlc_stm32_tx_init(void)
{
	const openvlc_tx_profile_t *profile = openvlc_tx_default_profile();

	if (!profile)
		return -1;
	memset(&tx_stats, 0, sizeof(tx_stats));
	memset(tx_slots, 0, sizeof(tx_slots));
	tx_busy = 0;
	tx_active_slot = -1;
	tx_last_slot = -1;
	tx_last_generation = 0u;
	tx_generation = 0u;
	tx_enqueue_order = 0u;
	tx_last_started_order = 0u;
	tx_active_start_cycles = 0u;
	tx_completion_baseline_cycles = UINT32_MAX;
	tx_last_complete_cycles = 0u;
	tx_guard_pending = 0u;
	tx_guard_counted = 0u;
	tx_guard_timer_armed = 0u;
	tx_stats.min_idle_cycles = UINT32_MAX;
#if OPENVLC_TX_HW_DIAG
	memset(&tx_hw_diag, 0, sizeof(tx_hw_diag));
	memset(&tx_hw_first_fault, 0, sizeof(tx_hw_first_fault));
	tx_diag_last_generation = 0u;
	tx_diag_last_ndtr = 0u;
	tx_diag_last_progress_cycles = 0u;
	tx_diag_last_sample_cycles = 0u;
#endif
	tx_stats.last_budget = profile->budget;
	tx_stats.last_cell_ticks = profile->cell_ticks;
	if (profile->cell_ticks)
		tx_idle_cell_ticks = profile->cell_ticks;
#if defined(STM32H743xx) || defined(STM32H723xx)
	CoreDebug->DEMCR |= CoreDebug_DEMCR_TRCENA_Msk;
	DWT->CYCCNT = 0u;
	DWT->CTRL |= DWT_CTRL_CYCCNTENA_Msk;
	__HAL_RCC_TIM6_CLK_ENABLE();
	tx_guard_timer_stop();
	HAL_NVIC_SetPriority(TIM6_DAC_IRQn, 2u, 0u);
	HAL_NVIC_EnableIRQ(TIM6_DAC_IRQn);
	HAL_GPIO_WritePin(OPENVLC_TX_GPIO_PORT, OPENVLC_TX_GPIO_PIN,
			  GPIO_PIN_RESET);
	if (htim1.Instance) {
		__HAL_TIM_SET_PRESCALER(&htim1, 0u);
		__HAL_TIM_SET_AUTORELOAD(&htim1, profile->cell_ticks - 1u);
		__HAL_TIM_SET_COUNTER(&htim1, 0u);
	}
#endif
	return 0;
}

int openvlc_stm32_tx_busy(void)
{
	return tx_busy;
}

uint32_t openvlc_stm32_tx_pipeline_depth(void)
{
	uint32_t primask = tx_irq_lock();
	uint32_t depth = tx_pipeline_depth_locked();

	tx_irq_unlock(primask);
	return depth;
}

int openvlc_stm32_tx_can_accept(void)
{
	uint32_t primask = tx_irq_lock();
	int free_slot = tx_find_slot(TX_SLOT_FREE);

	tx_irq_unlock(primask);
	return free_slot >= 0;
}

const openvlc_stm32_tx_stats_t *openvlc_stm32_tx_stats(void)
{
	return &tx_stats;
}

void openvlc_stm32_tx_diag_poll(void)
{
#if (defined(STM32H743xx) || defined(STM32H723xx)) && OPENVLC_TX_HW_DIAG
	openvlc_stm32_tx_hw_diag_t sample;
	uint32_t now;
	uint32_t faults;
	uint32_t primask;

	now = tx_cycle_count();
	if ((now - tx_diag_last_sample_cycles) < OPENVLC_TX_DIAG_SAMPLE_CYCLES)
		return;
	tx_diag_last_sample_cycles = now;
	primask = tx_irq_lock();
	tx_read_hw_snapshot(&sample);
	tx_irq_unlock(primask);
	faults = tx_hw_fault_flags(&sample);
	if (sample.busy) {
		if (sample.active_generation != tx_diag_last_generation ||
		    sample.dma_ndtr != tx_diag_last_ndtr) {
			tx_diag_last_generation = sample.active_generation;
			tx_diag_last_ndtr = sample.dma_ndtr;
			tx_diag_last_progress_cycles = now;
		} else if ((now - tx_diag_last_progress_cycles) >
			   OPENVLC_TX_DIAG_STALL_CYCLES) {
			faults |= OPENVLC_TX_HW_FAULT_STALLED;
		}
	} else {
		tx_diag_last_generation = 0u;
		tx_diag_last_ndtr = 0u;
		tx_diag_last_progress_cycles = now;
	}
	sample.samples = tx_hw_diag.samples + 1u;
	sample.fault_events = tx_hw_diag.fault_events;
	sample.latched_fault_flags = tx_hw_diag.latched_fault_flags;
	sample.fault_flags = faults;
	if (faults) {
		if (tx_hw_diag.fault_flags == 0u ||
		    tx_hw_diag.fault_flags != faults)
			sample.fault_events++;
		sample.latched_fault_flags |= faults;
		if (tx_hw_diag.latched_fault_flags == 0u) {
			tx_hw_first_fault = sample;
			tx_hw_first_fault.latched_fault_flags = faults;
		}
	}
	tx_hw_diag = sample;
#endif
}

void openvlc_stm32_tx_hw_snapshot(openvlc_stm32_tx_hw_diag_t *snapshot)
{
	if (!snapshot)
		return;
#if (defined(STM32H743xx) || defined(STM32H723xx)) && OPENVLC_TX_HW_DIAG
	{
		uint32_t primask = tx_irq_lock();
		*snapshot = tx_hw_diag;
		tx_irq_unlock(primask);
	}
#else
	memset(snapshot, 0, sizeof(*snapshot));
#endif
}

void openvlc_stm32_tx_hw_first_fault(openvlc_stm32_tx_hw_diag_t *snapshot)
{
	if (!snapshot)
		return;
#if (defined(STM32H743xx) || defined(STM32H723xx)) && OPENVLC_TX_HW_DIAG
	{
		uint32_t primask = tx_irq_lock();
		*snapshot = tx_hw_first_fault;
		tx_irq_unlock(primask);
	}
#else
	memset(snapshot, 0, sizeof(*snapshot));
#endif
}

void openvlc_stm32_tx_idle_poll(void)
{
#if (defined(STM32H743xx) || defined(STM32H723xx)) && \
	defined(OPENVLC_TX_IDLE_KEEPALIVE) && OPENVLC_TX_IDLE_KEEPALIVE
	uint32_t primask;
	uint32_t cycles_per_ms = SystemCoreClock / 1000u;
	uint32_t limit;

