lucasantoro/Sunrise/communications/openvlc/firmware-v2/firmware/platform/stm32h7/openvlc_stm32_tx_hal.c
	/*
	 * Deferred keep-alive start. The frame ended, the line has been dark for
	 * OPENVLC_TX_IDLE_GAP_US - long enough for the receiver to close the
	 * burst on that gap - so re-light it to hold the AGC until the next
	 * frame. tx_busy is re-checked under PRIMASK because tx_arm_and_start()
	 * may take the timer over in between; it rewrites ARR/CCR1 itself, so
	 * losing the race simply means no keep-alive for this interval.
	 */
	if (tx_idle_pending && cycles_per_ms) {
		uint32_t cycles_per_us = cycles_per_ms / 1000u;
		uint32_t gap = OPENVLC_TX_IDLE_GAP_US * cycles_per_us;

		if (cycles_per_us &&
		    (tx_cycle_count() - tx_last_complete_cycles) >= gap) {
			primask = tx_irq_lock();
			if (tx_idle_pending && !tx_busy) {
				CLEAR_BIT(htim1.Instance->CCMR1,
					  TIM_CCMR1_OC1PE);
				/*
				 * Duty is NOT 50%: see
				 * OPENVLC_TX_IDLE_DUTY_PERCENT. A 50% square wave
				 * puts its fifth harmonic - 5 MHz at the 1 MHz cell
				 * rate - at maximum, right on the measured receive
				 * resonance. 40% nulls that harmonic exactly.
				 */
				htim1.Instance->CCR1 =
					(2u * tx_idle_cell_ticks *
					 OPENVLC_TX_IDLE_DUTY_PERCENT + 50u) / 100u;
				SET_BIT(htim1.Instance->CCMR1, TIM_CCMR1_OC1PE);
				__HAL_TIM_SET_AUTORELOAD(
					&htim1, 2u * tx_idle_cell_ticks - 1u);
				__HAL_TIM_SET_COUNTER(&htim1, 0u);
				htim1.Instance->EGR = TIM_EGR_UG;
				htim1.Instance->SR = 0u;
				SET_BIT(htim1.Instance->CCER, TIM_CCER_CC1E);
				SET_BIT(htim1.Instance->BDTR, TIM_BDTR_MOE);
				SET_BIT(htim1.Instance->CR1, TIM_CR1_CEN);
				tx_idle_active = 1u;
			}
			tx_idle_pending = 0u;
			tx_irq_unlock(primask);
		}
	}

	if (!tx_idle_active || tx_busy || !cycles_per_ms)
		return;
	limit = OPENVLC_TX_IDLE_KEEPALIVE_MS * cycles_per_ms;
	if ((tx_cycle_count() - tx_last_complete_cycles) < limit)
		return;

	/*
	 * The host has had nothing to send for OPENVLC_TX_IDLE_KEEPALIVE_MS, so
	 * stop illuminating: hold the AGC only while a stream is actually
	 * running. Re-check tx_busy under PRIMASK because a frame may be armed
	 * between the test above and the teardown.
	 */
	primask = tx_irq_lock();
	if (!tx_busy && tx_idle_active) {
		CLEAR_BIT(htim1.Instance->CR1, TIM_CR1_CEN);
		CLEAR_BIT(htim1.Instance->CCER, TIM_CCER_CC1E);
		CLEAR_BIT(htim1.Instance->BDTR, TIM_BDTR_MOE);
		CLEAR_BIT(htim1.Instance->CCMR1, TIM_CCMR1_OC1PE);
		htim1.Instance->CCR1 = 0u;
		SET_BIT(htim1.Instance->CCMR1, TIM_CCMR1_OC1PE);
		tx_idle_active = 0u;
	}
	tx_irq_unlock(primask);
#endif
}

void openvlc_stm32_tx_service(void)
{
#if defined(STM32H743xx) || defined(STM32H723xx)
	uint32_t primask;
	int slot;
	int status;

	primask = tx_irq_lock();
	if (tx_busy) {
		tx_irq_unlock(primask);
		return;
	}
	slot = tx_find_oldest_ready();
	if (slot < 0) {
		tx_irq_unlock(primask);
		return;
	}
#if defined(STM32H743xx) || defined(STM32H723xx)
	if (tx_guard_pending) {
		uint32_t now_cycles = tx_cycle_count();
		uint32_t elapsed = now_cycles - tx_last_complete_cycles;
		uint32_t guard_cycles =
			(SystemCoreClock / 1000000u) *
			OPENVLC_STM32_TX_INTERFRAME_GUARD_US;
		uint32_t period_cycles =
			(SystemCoreClock / 1000000u) *
			OPENVLC_STM32_TX_TARGET_PERIOD_US;
		int32_t guard_remaining = guard_cycles ?
			(int32_t)(tx_last_complete_cycles + guard_cycles -
				  now_cycles) : 0;
		int32_t period_remaining = period_cycles ?
			(int32_t)(tx_active_start_cycles + period_cycles -
				  now_cycles) : 0;
		uint32_t remaining_cycles = 0u;

		if (guard_remaining > 0)
			remaining_cycles = (uint32_t)guard_remaining;
		if (period_remaining > 0 &&
		    (uint32_t)period_remaining > remaining_cycles)
			remaining_cycles = (uint32_t)period_remaining;

		if (remaining_cycles != 0u) {
			if (!tx_guard_counted) {
				tx_stats.guard_waits++;
				tx_guard_counted = 1u;
			}
			if (!tx_guard_timer_armed)
				tx_guard_timer_arm(remaining_cycles);
			tx_irq_unlock(primask);
			return;
		}
		if (tx_guard_timer_armed)
			tx_guard_timer_stop();
		tx_stats.last_idle_cycles = elapsed;
		if (elapsed < tx_stats.min_idle_cycles)
			tx_stats.min_idle_cycles = elapsed;
		if (elapsed > tx_stats.max_idle_cycles)
			tx_stats.max_idle_cycles = elapsed;
		tx_guard_pending = 0u;
		tx_guard_counted = 0u;
	}
#endif
	tx_slots[slot].state = TX_SLOT_ACTIVE;
	if (tx_last_started_order != 0u &&
	    tx_slots[slot].enqueue_order != tx_last_started_order + 1u)
		tx_stats.fifo_violations++;
	tx_last_started_order = tx_slots[slot].enqueue_order;
	tx_active_slot = (int8_t)slot;
	tx_busy = 1;
	tx_irq_unlock(primask);

	status = tx_arm_and_start(slot);
	if (status != 0) {
		primask = tx_irq_lock();
		tx_slots[slot].state = TX_SLOT_FREE;
		tx_active_slot = -1;
		tx_busy = 0;
		tx_irq_unlock(primask);
	}
#else
	int slot = tx_find_oldest_ready();

	if (slot >= 0) {
		tx_slots[slot].state = TX_SLOT_FREE;
		tx_stats.started++;
		tx_stats.completed++;
	}
#endif
}

void openvlc_stm32_tx_guard_irq(void)
{
#if defined(STM32H743xx) || defined(STM32H723xx)
	if ((TIM6->SR & TIM_SR_UIF) == 0u)
		return;
	tx_guard_timer_stop();
	openvlc_stm32_tx_service();
#endif
}

int openvlc_stm32_tx_send_packet(const openvlc_packet_t *packet)
{
	const openvlc_tx_profile_t *profile = openvlc_tx_default_profile();
#if !defined(OPENVLC_TX_USE_TIMER_OC) || !OPENVLC_TX_USE_TIMER_OC
	openvlc_tx_dma_buffer_t dma;
#endif
	openvlc_status_t status;
	uint32_t primask;
	uint32_t encode_start;
	uint32_t encode_cycles;
	int slot;

	if (!profile || !packet)
		return -1;

	primask = tx_irq_lock();
	slot = tx_find_slot(TX_SLOT_FREE);
	if (slot < 0) {
		tx_stats.busy_drops++;
		tx_irq_unlock(primask);
		return -2;
	}
	tx_slots[slot].state = TX_SLOT_PREPARING;
	tx_irq_unlock(primask);

	encode_start = tx_cycle_count();

#if defined(OPENVLC_TX_USE_TIMER_OC) && OPENVLC_TX_USE_TIMER_OC
	{
		size_t word_len = 0u;
		openvlc_tx_oc_stats_t word_stats;

		status = openvlc_tx_compat_packet_to_oc_words(
			packet, profile, tx_dma_words[slot],
			OPENVLC_STM32_TX_DMA_WORDS, &word_len,
			&word_stats);
		if (status == OPENVLC_OK) {
			tx_slots[slot].word_len = (uint32_t)word_len;
			tx_slots[slot].high_words = word_stats.high_words;
			tx_slots[slot].low_words = word_stats.low_words;
			tx_slots[slot].word_checksum = word_stats.checksum;
		}
	}
#else
	dma.words = tx_dma_words[slot];
	dma.word_cap = OPENVLC_STM32_TX_DMA_WORDS;
	dma.word_len = 0;
	status = openvlc_tx_compat_packet_to_bsrr(packet, profile,
					       (uint32_t)OPENVLC_TX_GPIO_PIN,
					       (uint32_t)OPENVLC_TX_GPIO_PIN << 16,
					       &dma);
#endif
	if (status != OPENVLC_OK) {
		encode_cycles = tx_cycle_count() - encode_start;
		tx_stats.encode_errors++;
		tx_stats.last_encode_cycles = encode_cycles;
		if (encode_cycles > tx_stats.max_encode_cycles)
			tx_stats.max_encode_cycles = encode_cycles;
		primask = tx_irq_lock();
		tx_slots[slot].state = TX_SLOT_FREE;
		tx_irq_unlock(primask);
		return (int)status;
	}

#if !defined(OPENVLC_TX_USE_TIMER_OC) || !OPENVLC_TX_USE_TIMER_OC
	tx_slots[slot].word_len = (uint32_t)dma.word_len;
#endif
	tx_slots[slot].cell_ticks = profile->cell_ticks;
	/*
	 * Cacheable fallback builds clean before publishing READY. Production
	 * places all TX slots in the non-cacheable .tx_dma_buffer MPU window, so
	 * no cache writeback can contend with an active TIM1 stream.
	 */
#if (defined(STM32H743xx) || defined(STM32H723xx)) && \
	(!defined(OPENVLC_TX_DMA_NONCACHEABLE) || \
	 !OPENVLC_TX_DMA_NONCACHEABLE)
	tx_clean_dcache(tx_dma_words[slot], tx_slots[slot].word_len);
#endif
#if defined(STM32H743xx) || defined(STM32H723xx)
	/* Publish READY only after every cell store is globally visible to DMA2. */
	__DSB();
#endif
	encode_cycles = tx_cycle_count() - encode_start;
	tx_slots[slot].generation = ++tx_generation;
	tx_stats.queued++;
	tx_stats.last_encode_cycles = encode_cycles;
	if (encode_cycles > tx_stats.max_encode_cycles)
		tx_stats.max_encode_cycles = encode_cycles;
	tx_stats.last_dma_words = tx_slots[slot].word_len;
	tx_stats.last_symbols =
		tx_slots[slot].word_len - profile->gap_cells - 1u;
	tx_stats.last_budget = profile->budget;
	tx_stats.last_cell_ticks = profile->cell_ticks;
	primask = tx_irq_lock();
	tx_last_slot = (int8_t)slot;
	tx_last_generation = tx_slots[slot].generation;
	tx_slots[slot].enqueue_order = ++tx_enqueue_order;
	tx_slots[slot].state = TX_SLOT_READY;
	tx_irq_unlock(primask);

	openvlc_stm32_tx_service();
	return 0;
}

int openvlc_stm32_tx_resend(void)
{
	uint32_t primask = tx_irq_lock();
	int slot = tx_last_slot;

	if (slot < 0 ||
	    slot >= (int)OPENVLC_STM32_TX_SLOT_COUNT ||
	    tx_slots[slot].generation != tx_last_generation) {
		tx_irq_unlock(primask);
		return -1;
	}
	if (tx_slots[slot].state != TX_SLOT_FREE) {
		tx_stats.busy_drops++;
		tx_irq_unlock(primask);
		return -2;
	}
	tx_slots[slot].enqueue_order = ++tx_enqueue_order;
	tx_slots[slot].state = TX_SLOT_READY;
	tx_stats.queued++;
	tx_irq_unlock(primask);
	openvlc_stm32_tx_service();
	return 0;
}

#if defined(OPENVLC_TEST_API)
int openvlc_test_tx_select_oldest_ready(const uint32_t *orders,
					 size_t count, uint32_t newest)
{
	if (!orders || count > OPENVLC_STM32_TX_SLOT_COUNT)
		return -1;
	memset(tx_slots, 0, sizeof(tx_slots));
	tx_enqueue_order = newest;
	for (size_t i = 0; i < count; i++) {
		tx_slots[i].state = TX_SLOT_READY;
		tx_slots[i].enqueue_order = orders[i];
	}
	return tx_find_oldest_ready();
}
#endif
